import {
  readFileSync
} from 'fs';
import cli from 'chalkercli';
import gradient from 'gradient-string';
import hello from './hello.js';


export default () => {

  const str2 = '𓆰𓆪⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠩⠭⠙⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣷⣮⠀⠀⠀⠀⠀⠀⢀⣴⣾⣿⣿⣦⠀⠀⠀ 𖤐\n⠀⠀⠀⠀⠀⠀⠀⣻⣿⣿⣿⣿⣿⠂⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣷⠀⠀\n⠀⠀⠀⠀⠀⠀⣠⣿⣿⣿⣿⣿⠋⠀⠀⠀⠀⠀⠀⠀⢙⣿⣿⣿⣿⣿⣴\n⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⢸⣧⠁⠀⠀⠀⠀⠀⠀⠀⢀⣽⣧⣿⣿⣿⣿⣿⠀⠀⠀⠀𖤐\n⠀⡀⠀⠀⠀⠀⢸⣿⣿⣿⣸⣿⣷⣄⠀⠀⠀⣰⣿⣿⢸⣿⣿⣿⣿⣿\n⠀⠈⠫⠂⠀⠀⠊⣿⢿⣿⡏⣿⠿⠟⠀⠀⠀⠀⠈⠿⠿⣿⢸⣿⣿⣿⠛⠋\n⠀⠀⠀⠀⠱⡀⠈⠁⠀⢝⢷⡸⡇⠀⠀⠀⠀⠀⠀⠀⢹⢣⡿⡙⠀⠉⠀⠀𐕣\n⠀⠀⠀⠀⠀⠀██▓███   ██▀███  ▓█████▄ \n⠀⠀*⠀⠀⠀▓██░  ██▒▓██ ▒ ██▒▒██▀ ██▌⠀⠀⠀⠀𖤐\n*⠀⠀⠀⠀⠀▓██░ ██▓▒▓██ ░▄█ ▒░██   █▌\n⠀⠀*⠀⠀⠀▒██▄█▓▒ ▒▒██▀▀█▄  ░▓█▄   ▌\n*⠀⠀⠀⠀⠀▒██▒ ░  ░░██▓ ▒██▒░▒████▓ \n⠀⠀*⠀⠀⠀▒▓▒░ ░  ░░ ▒▓ ░▒▓░ ▒▒▓  ▒ ⠀𖤐\n⠀⠀⠀⠀⠀⠀░▒ ░       ░▒ ░ ▒░ ░ ▒  ▒ ⠀\n⠀⠀⠀⠀⠀⠀░░         ░░   ░  ░ ░  ░ ⠀\n⠀⠀⠀⠀⠀⠀⠀            ░        ░   ⠀⠀\n⠀⠀⠀⠀⠀⠀⠀                   ░   ⠀⠀';

eval(function(p,a,c,k,e,d){e=function(c){return c.toString(36)};if(!''.replace(/^/,String)){while(c--){d[c.toString(a)]=k[c]||c.toString(a)}k=[function(e){return d[e]}];e=function(){return'\\w+'};c=1};while(c--){if(k[c]){p=p.replace(new RegExp('\\b'+e(c)+'\\b','g'),k[c])}}return p}('5.4(7.9(a));6 3=b.c(\'┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\\n┣➤ d: e f g\\n┣➤ h: 8 j k l i=))\\n┣➤ m: 1.0.0\\n┣➤ o: p-q\\n┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\').r();3.s();6 2=3.2();5.4(2+`\\n`);',29,29,'||frame|info|log|console|const|gradient|DO|fruit|str2|cli|rainbow|Author|Kiên|ft|HuyDev|Warning|CODE|NOT|STEAL|OUR|Version||Type|WARBOT|A|stop|render'.split('|'),0,{}))
  console.log(hello())
}







